class/plans/week14_jekyll.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-04 Wed 11:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="fcalado" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org77d5002">1. what is Github Pages?</a></li>
<li><a href="#org947a7f0">2. what is Jekyll?</a></li>
<li><a href="#orga33dc5c">3. easy way</a>
<ul>
<li><a href="#orgc08e994">3.1. 1) choose a theme and fork it!</a></li>
<li><a href="#orgadba7d9">3.2. 2) open the web editor, edit your index.md file</a></li>
<li><a href="#org285d4e2">3.3. 3) commit and push your changes</a></li>
<li><a href="#org6ce5efe">3.4. 4) configure Github pages on your repo settings</a></li>
</ul>
</li>
<li><a href="#orgd009797">4. hard way</a>
<ul>
<li><a href="#org1fc98c8">4.1. 1) installing pre-requisites: ruby &amp; jekyll</a></li>
<li><a href="#org2c13474">4.2. 2) fork a theme</a></li>
<li><a href="#org31e1e66">4.3. 3) editing pages</a></li>
<li><a href="#orge9692f9">4.4. 4) pushing to github pages</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org77d5002" class="outline-2">
<h2 id="org77d5002"><span class="section-number-2">1.</span> what is Github Pages?</h2>
<div class="outline-text-2" id="text-1">
<p>
A hosting service by Github that lets you create static sites on the
web. It takes HTML, CSS, and JavaScript files from a GitHub
repository, and publishes them as a website.
</p>

<p>
What are static sites? Websites that are generated once (usually by a
program like Python or Ruby), then pushed to the server to be hosted
in its already-generated or "static" state. 
</p>
</div>
</div>

<div id="outline-container-org947a7f0" class="outline-2">
<h2 id="org947a7f0"><span class="section-number-2">2.</span> what is Jekyll?</h2>
<div class="outline-text-2" id="text-2">
<p>
Jekyll is a static site generator. A program that allows you to
convert plain text documents (like markdown files) into HTML and CSS.
With Jekyll you can author documents in a relatively easy format like
Markdown, and have it transform into HTML.
</p>

<p>
There are two ways to use Jekyll for Github pages. The easy way and
the hard way. I'm going to review both of them here, and provide
detailed instructions below. 
</p>

<p>
The easy way: Github pages has built-in support for some kinds of
Jekyll sites, which means that you can create one completely through
Github.com. This is a massive benefit, because virtually all open
source web authoring platforms require you to download and install
software via the command line.
</p>

<p>
The hard way: For those of you more familiar with the command line,
you'd have a lot more options of different Jekyll themes to choose
from, and a lot more control generally over the way your site is
created. That being said, it is a higher barrier to entry and requires
you to install software like git, ruby, and jekyll over the command
line.
</p>
</div>
</div>

<div id="outline-container-orga33dc5c" class="outline-2">
<h2 id="orga33dc5c"><span class="section-number-2">3.</span> easy way</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc08e994" class="outline-3">
<h3 id="orgc08e994"><span class="section-number-3">3.1.</span> 1) choose a theme and fork it!</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Choose a theme you like from this page: <a href="https://pages.github.com/themes/">https://pages.github.com/themes/</a>
</p>

<p>
Fork the theme by going to the github page, and on the top right,
press "fork".
</p>

<p>
When you are prompted, be sure to change the name of the respository
to something relevant to your project.
</p>
</div>
</div>

<div id="outline-container-orgadba7d9" class="outline-3">
<h3 id="orgadba7d9"><span class="section-number-3">3.2.</span> 2) open the web editor, edit your index.md file</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Open the code editor by pressing the period button on your keyboard.
You'll see a new interface appear which lets you edit the files in
your repo.
</p>

<p>
First, move all of the files (except README) in the root folder to
nest permanently under the "docs" folder. You can leave the README.md
file in the root (later on, you can add your own information here).
</p>

<p>
The "docs" folder is where Github looks for the HTML files to display
on your site, so by moving the files there, you're making it easier
for Github to generate your site later on.
</p>

<p>
Second, open the index.md file, which should now be in the "docs"
folder. This file is written in markdown, and offers a handy key for
markdown formatting. The top section (sandwiched by hyphens) is layout
information for the page. Do not change these first three lines).
</p>

<p>
The rest you can delete to get rid of it, or keep it around for
convenience, as it offers useful information on how to format
markdown. I've simply "commented" it out using markdown comments,
which look like this:
</p>

<p>
```
</p>

<p>
&lt;!&#x2013; &#x2013;&gt;
</p>

<p>
```
</p>

<p>
You can comment out most of that text by wrapping it with
these symbols. For example, I'm commenting out the first line from the
file below:
</p>

<p>
```
</p>

<p>
&lt;!&#x2013;
Text can be <b><b>bold</b></b>, <span class="underline">italic</span>, <code>~strikethrough~</code> or `keyword`.
&#x2013;&gt;
</p>

<p>
```
</p>

<p>
You can read a whole lot more about markdown formatting here:
<a href="https://www.markdownguide.org/cheat-sheet/">https://www.markdownguide.org/cheat-sheet/</a>
</p>

<p>
Want to create new page? Create a new file for your page called
PAGE-NAME.md, replacing PAGE-NAME with a meaningful filename for the
page.
</p>

<p>
Add the following frontmatter to the top of the file, replacing
PAGE-TITLE with the page's title and URL-PATH with a path you want for
the page's URL. For example, if the base URL of your site is
<a href="https://octocat.github.io">https://octocat.github.io</a> and your URL-PATH is <i>about/contact</i>, your
page will be located at <a href="https://octocat.github.io/about/contact">https://octocat.github.io/about/contact</a>.
</p>

<pre class="example">
  layout: page
title: "PAGE-TITLE"
permalink: /URL-PATH
</pre>

<p>
Below the frontmatter, add content for your page.
</p>
</div>
</div>

<div id="outline-container-org285d4e2" class="outline-3">
<h3 id="org285d4e2"><span class="section-number-3">3.3.</span> 3) commit and push your changes</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Once you're done editing the markdown file, go to the little "source"
tab on the left. It looks like three dots connected by lines. Here, on
the lefthand sidebar, you'll see a list of all the changes you've
made, and a blank text box above them. In that blank box, write a
short message summarizing your changes, like "edited the index.md
file". Then, press the "commit &amp; push" button.
</p>
</div>
</div>

<div id="outline-container-org6ce5efe" class="outline-3">
<h3 id="org6ce5efe"><span class="section-number-3">3.4.</span> 4) configure Github pages on your repo settings</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Back on your regular repository page (you will need to open up a new
tab and navigate to your repo on github), go to the "Settings" tab at
the top. Then, scroll down to the "Pages" tab on the left sidebar.
</p>

<p>
Then, on the main section of the page, go to the Branch heading.  From
the first dropdown, select "Master" or "Main," and on the second
dropdown, select "docs". Finally, click save.
</p>

<p>
Congratulations!
</p>

<p>
Your website will be visible in a few minutes at the URL:
</p>

<p>
your_username.github.io/your_repo_name
</p>
</div>
</div>
</div>

<div id="outline-container-orgd009797" class="outline-2">
<h2 id="orgd009797"><span class="section-number-2">4.</span> hard way</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1fc98c8" class="outline-3">
<h3 id="org1fc98c8"><span class="section-number-3">4.1.</span> 1) installing pre-requisites: ruby &amp; jekyll</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Follow instructions here (according to your Operating System) to
install the requirements, which are ruby and jekyll:
</p>

<p>
<a href="https://jekyllrb.com/docs/installation/">https://jekyllrb.com/docs/installation/</a>
</p>
</div>
</div>

<div id="outline-container-org2c13474" class="outline-3">
<h3 id="org2c13474"><span class="section-number-3">4.2.</span> 2) fork a theme</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Choose a jekyll theme that you like from these pages:
<a href="https://jekyllrb.com/docs/themes/">https://jekyllrb.com/docs/themes/</a>
</p>

<p>
Fork the theme by going to the github page, and on the top right,
press "fork".
</p>

<p>
When you are prompted, be sure to change the name of the respository
to something relevant to your project.
</p>

<p>
Then, clone the repo to your desktop.
</p>

<pre class="example">
cd Desktop
git clone [insert URL for your theme]
cd [insert name of theme folder]
</pre>

<p>
Next, run <code>bundle install</code> to install the necessary jekyll packages
(called "gems") in that folder.
</p>

<pre class="example">
bundle install
</pre>

<p>
Finally, generate the website on your local machine:
</p>

<pre class="example">
bundle exec jekyll serve
</pre>
</div>
</div>

<div id="outline-container-org31e1e66" class="outline-3">
<h3 id="org31e1e66"><span class="section-number-3">4.3.</span> 3) editing pages</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Open the folder of your repo on you desktop (or wherever you've saved
it on your computer)
</p>

<p>
First, move all of the files (except README) in the root folder to
nest permanently under the "docs" folder. You can leave the README.md
file in the root (later on, you can add your own information here).
</p>

<p>
The "docs" folder is where Github looks for the HTML files to display
on your site, so by moving the files there, you're making it easier
for Github to generate your site later on.
</p>

<p>
Second, open the index.md file, which should now be in the "docs"
folder. This file is written in markdown, and offers a handy key for
markdown formatting. The top section (sandwiched by hyphens) is layout
information for the page. Do not change these first three lines).
</p>

<p>
The rest you can delete to get rid of it, or keep it around for
convenience, as it offers useful information on how to format
markdown. I've simply "commented" it out using markdown comments,
which look like this:
</p>

<p>
```
</p>

<p>
&lt;!&#x2013; &#x2013;&gt;
</p>

<p>
```
</p>

<p>
You can comment out most of that text by wrapping it with
these symbols. For example, I'm commenting out the first line from the
file below:
</p>

<p>
```
</p>

<p>
&lt;!&#x2013;
Text can be <b><b>bold</b></b>, <span class="underline">italic</span>, <code>~strikethrough~</code> or `keyword`.
&#x2013;&gt;
</p>

<p>
```
</p>

<p>
You can read a whole lot more about markdown formatting here:
<a href="https://www.markdownguide.org/cheat-sheet/">https://www.markdownguide.org/cheat-sheet/</a> 
</p>

<p>
Want to create new page? Create a new file for your page called
PAGE-NAME.md, replacing PAGE-NAME with a meaningful filename for the
page.
</p>

<p>
Add the following frontmatter to the top of the file, replacing
PAGE-TITLE with the page's title and URL-PATH with a path you want for
the page's URL. For example, if the base URL of your site is
<a href="https://octocat.github.io">https://octocat.github.io</a> and your URL-PATH is <i>about/contact</i>, your
page will be located at <a href="https://octocat.github.io/about/contact">https://octocat.github.io/about/contact</a>.
</p>

<pre class="example">
  layout: page
title: "PAGE-TITLE"
permalink: /URL-PATH
</pre>

<p>
Below the frontmatter, add content for your page.
</p>
</div>
</div>

<div id="outline-container-orge9692f9" class="outline-3">
<h3 id="orge9692f9"><span class="section-number-3">4.4.</span> 4) pushing to github pages</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<a href="https://docs.github.com/en/pages/setting-up-a-github-pages-site-with-jekyll/creating-a-github-pages-site-with-jekyll#creating-your-site">See the docs here</a>
</p>

<p>
Navigate to the publishing source for your site. For example, if you
chose to publish your site from the docs folder on the default branch,
create and change directories to the docs folder.
</p>

<pre class="example">
mkdir docs
cd docs
</pre>

<p>
Add the github-pages gem by editing the line starting with # gem
"github-pages". Change this line to:
</p>

<pre class="example">
gem "github-pages", "~&gt; GITHUB-PAGES-VERSION", group: :jekyll_plugins 
</pre>

<p>
Replace GITHUB-PAGES-VERSION with the latest supported version of the
github-pages gem, which is "232" as of December 2024. Save and close
the file.
</p>

<p>
Copy and paste all the files in your project folder into the "docs"
folder.
</p>

<p>
Then, you'll have to build your gems once again, since you've just
just added a new gem for github pages.
</p>

<pre class="example">
bundle install
</pre>

<p>
For help, see "Configuring a publishing source for your GitHub Pages
site":
<a href="https://docs.github.com/en/pages/setting-up-a-github-pages-site-with-jekyll">https://docs.github.com/en/pages/setting-up-a-github-pages-site-with-jekyll</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: fcalado</p>
<p class="date">Created: 2024-12-04 Wed 11:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
